#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//& - 按（2进制）位与
//| - 按（2进制）位或
//^ - 按（2进制）位异或 - 相同为0，相异为1
//内存中储存的都是补码
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a & b;
//	//0000 0000 0000 0000 0000 0000 0000 0011 - 3的补码（原码、反码）
//	//1000 0000 0000 0000 0000 0000 0000 0101 - 5的原码
//	//1111 1111 1111 1111 1111 1111 1111 1010 - 5的反码
//	//1111 1111 1111 1111 1111 1111 1111 1011 - 5的补码
//	//0000 0000 0000 0000 0000 0000 0000 0011 - 3和5的按位与的补码
//	printf("c = %d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("交换后：a=%d b=%d\n", a, b);
//	return 0;
//
//}

//编写代码实现：求一个整数存储在内存中的二进制中1的个数
int main()
{
	int a = 0;
	int i = 0;
	int count = 0;
	scanf("%d", &a);
	for (i = 0; i < 32; i++)
	{
		if (a & 1 == 1)
		{
			count++;
			a = a >> 1;
		}
		else
		{
			a = a >> 1;
		}
	}
	printf("%d\n", count);
	return 0;
}